RT-Thread/rt-thread/bsp/gd32/libraries/GD32F2xx_STD/GD32F20x_standard_peripheral/Include/gd32f20x_rcu.h
/* RCU_CFG2 */
#define RCU_CFG2_CKOUT0DIV              BITS(0,5)                 /*!< CK_OUT0 divider */
#define RCU_CFG2_CKOUT1DIV              BITS(8,13)                /*!< CK_OUT1 divider */
#define RCU_CFG2_CKOUT1SEL              BITS(16,19)               /*!< CKOUT1 clock source selection */

/* RCU_PLLTCTL */
#define RCU_PLLTCTL_PLLTEN              BIT(28)                   /*!< PLLT enable */
#define RCU_PLLTCTL_PLLTSTB             BIT(29)                   /*!< PLLT clock stabilization flag */

/* RCU_PLLTINT */
#define RCU_PLLTINT_PLLTSTBIF           BIT(6)                    /*!< PLLT stabilization interrupt flag */
#define RCU_PLLTINT_PLLTSTBIE           BIT(14)                   /*!< PLLT stabilization interrupt enable */
#define RCU_PLLTINT_PLLTSTBIC           BIT(22)                   /*!< PLLT stabilization interrupt clear */

/* RCU_PLLTCFG */
#define RCU_PLLTCFG_PLLTPSC             BITS(0,5)                 /*!< PLLT prescaler selection */
#define RCU_PLLTCFG_PLLTMF              BITS(6,14)                /*!< PLLT multiply factor for VCO */
#define RCU_PLLTCFG_TLIPSC              BITS(16,17)               /*!< TLI prescaler selection */
#define RCU_PLLTCFG_PLLTRPSC            BITS(28,30)               /*!< PLLTR prescaler selection */
#define RCU_PLLTCFG_PLLTSEL             BIT(31)                   /*!< PLLT clock source select */

/* constants definitions */
/* define the peripheral clock enable bit position and its register index offset */
#define RCU_REGIDX_BIT(regidx, bitpos)      (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define RCU_REG_VAL(periph)                 (REG32(RCU + ((uint32_t)(periph) >> 6)))
#define RCU_BIT_POS(val)                    ((uint32_t)(val) & 0x1FU)

/* register offset */
/* peripherals enable */
#define AHB1EN_REG_OFFSET               0x14U                     /*!< AHB1 enable register offset */
#define APB2EN_REG_OFFSET               0x18U                     /*!< APB2 enable register offset */
#define APB1EN_REG_OFFSET               0x1CU                     /*!< APB1 enable register offset */
#define AHB2EN_REG_OFFSET               0x60U                     /*!< AHB2 enable register offset */
#define ADD_APB2EN_REG_OFFSET           0x64U                     /*!< APB2 additional enable register offset */
#define ADD_APB1EN_REG_OFFSET           0x68U                     /*!< APB1 additional enable register offset */

/* peripherals reset */
#define APB2RST_REG_OFFSET              0x0CU                     /*!< APB2 reset register offset */
#define APB1RST_REG_OFFSET              0x10U                     /*!< APB1 reset register offset */
#define RSTSCK_REG_OFFSET               0x24U                     /*!< reset source / clock register offset */
#define AHB1RST_REG_OFFSET              0x28U                     /*!< AHB1 reset register offset */
#define AHB2RST_REG_OFFSET              0x70U                     /*!< AHB2 reset register offset */
#define ADD_APB2RST_REG_OFFSET          0x74U                     /*!< APB2 additional reset register offset */
#define ADD_APB1RST_REG_OFFSET          0x78U                     /*!< APB1 additional reset register offset */

/* clock control */
#define CTL_REG_OFFSET                  0x00U                     /*!< control register offset */
#define BDCTL_REG_OFFSET                0x20U                     /*!< backup domain control register offset */
#define PLLTCTL_REG_OFFSET              0x90U                     /*!< PLLT control register offset */

/* clock stabilization and stuck interrupt */
#define INT_REG_OFFSET                  0x08U                     /*!< interrupt register offset */
#define PLLTINT_REG_OFFSET              0x94U                     /*!< PLLT interrupt register offset */

/* configuration register */
#define CFG0_REG_OFFSET                 0x04U                     /*!< configuration register 0 offset */
#define CFG1_REG_OFFSET                 0x2CU                     /*!< configuration register 1 offset */
#define CFG2_REG_OFFSET                 0x80U                     /*!< configuration register 2 offset */
#define PLLTCFG_REG_OFFSET              0x98U                     /*!< PLLT configuration register offset */

/* peripheral clock enable */
typedef enum
{
    /* AHB peripherals */
    RCU_DMA0      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 0U),                  /*!< DMA0 clock */
    RCU_DMA1      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 1U),                  /*!< DMA1 clock */
    RCU_CRC       = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 6U),                  /*!< CRC clock */
    RCU_EXMC      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 8U),                  /*!< EXMC clock */
    RCU_SDIO      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 10U),                 /*!< SDIO clock */
    RCU_USBFS     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 12U),                 /*!< USBFS clock */
    RCU_ENET      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 14U),                 /*!< ENET clock */
    RCU_ENETTX    = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 15U),                 /*!< ENETTX clock */
    RCU_ENETRX    = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 16U),                 /*!< ENETRX clock */

    RCU_DCI       = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 0U),                  /*!< DCI clock */
    RCU_CAU       = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 4U),                  /*!< CAU clock */
    RCU_HAU       = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 5U),                  /*!< HAU clock */
    RCU_TRNG      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 6U),                  /*!< TRNG clock */

    /* APB1 peripherals */
    RCU_TIMER1    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 0U),                  /*!< TIMER1 clock */
    RCU_TIMER2    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 1U),                  /*!< TIMER2 clock */
    RCU_TIMER3    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 2U),                  /*!< TIMER3 clock */
    RCU_TIMER4    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 3U),                  /*!< TIMER4 clock */
    RCU_TIMER5    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 4U),                  /*!< TIMER5 clock */
    RCU_TIMER6    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 5U),                  /*!< TIMER6 clock */
    RCU_TIMER11   = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 6U),                  /*!< TIMER11 clock */
    RCU_TIMER12   = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 7U),                  /*!< TIMER12 clock */
    RCU_TIMER13   = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 8U),                  /*!< TIMER13 clock */
    RCU_WWDGT     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 11U),                 /*!< WWDGT clock */
    RCU_SPI1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 14U),                 /*!< SPI1 clock */
    RCU_SPI2      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 15U),                 /*!< SPI2 clock */
    RCU_USART1    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 17U),                 /*!< USART1 clock */
    RCU_USART2    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 18U),                 /*!< USART2 clock */
    RCU_UART3     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 19U),                 /*!< UART3 clock */
    RCU_UART4     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 20U),                 /*!< UART4 clock */
    RCU_I2C0      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 21U),                 /*!< I2C0 clock */
    RCU_I2C1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 22U),                 /*!< I2C1 clock */
    RCU_CAN0      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 25U),                 /*!< CAN0 clock */
    RCU_CAN1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 26U),                 /*!< CAN1 clock */
    RCU_BKPI      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 27U),                 /*!< BKPI clock */
    RCU_PMU       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 28U),                 /*!< PMU clock */
    RCU_DAC       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 29U),                 /*!< DAC clock */

