RT-Thread/rt-thread/bsp/gd32/libraries/GD32F2xx_STD/GD32F20x_standard_peripheral/Include/gd32f20x_rcu.h
/* ADC prescaler selection */
#define RCU_CKADC_CKAPB2_DIV2           ((uint32_t)0x00000000U)             /*!< ADC prescaler select CK_APB2/2 */
#define RCU_CKADC_CKAPB2_DIV4           ((uint32_t)0x00000001U)             /*!< ADC prescaler select CK_APB2/4 */
#define RCU_CKADC_CKAPB2_DIV6           ((uint32_t)0x00000002U)             /*!< ADC prescaler select CK_APB2/6 */
#define RCU_CKADC_CKAPB2_DIV8           ((uint32_t)0x00000003U)             /*!< ADC prescaler select CK_APB2/8 */
#define RCU_CKADC_CKAPB2_DIV12          ((uint32_t)0x00000005U)             /*!< ADC prescaler select CK_APB2/12 */
#define RCU_CKADC_CKAPB2_DIV16          ((uint32_t)0x00000007U)             /*!< ADC prescaler select CK_APB2/16 */

/* PLL clock source selection */
#define RCU_PLLSRC_IRC8M_DIV2           ((uint32_t)0x00000000U)             /*!< IRC8M/2 clock selected as source clock of PLL */
#define RCU_PLLSRC_HXTAL                RCU_CFG0_PLLSEL                     /*!< HXTAL selected as source clock of PLL */

/* PLL clock multiplication factor */
#define PLLMF_4                         RCU_CFG0_PLLMF_4                    /* bit 4 of PLLMF */

#define CFG0_PLLMF(regval)              (BITS(18,21) & ((uint32_t)(regval) << 18))
#define RCU_PLL_MUL2                    CFG0_PLLMF(0)                       /*!< PLL source clock multiply by 2 */
#define RCU_PLL_MUL3                    CFG0_PLLMF(1)                       /*!< PLL source clock multiply by 3 */
#define RCU_PLL_MUL4                    CFG0_PLLMF(2)                       /*!< PLL source clock multiply by 4 */
#define RCU_PLL_MUL5                    CFG0_PLLMF(3)                       /*!< PLL source clock multiply by 5 */
#define RCU_PLL_MUL6                    CFG0_PLLMF(4)                       /*!< PLL source clock multiply by 6 */
#define RCU_PLL_MUL7                    CFG0_PLLMF(5)                       /*!< PLL source clock multiply by 7 */
#define RCU_PLL_MUL8                    CFG0_PLLMF(6)                       /*!< PLL source clock multiply by 8 */
#define RCU_PLL_MUL9                    CFG0_PLLMF(7)                       /*!< PLL source clock multiply by 9 */
#define RCU_PLL_MUL10                   CFG0_PLLMF(8)                       /*!< PLL source clock multiply by 10 */
#define RCU_PLL_MUL11                   CFG0_PLLMF(9)                       /*!< PLL source clock multiply by 11 */
#define RCU_PLL_MUL12                   CFG0_PLLMF(10)                      /*!< PLL source clock multiply by 12 */
#define RCU_PLL_MUL13                   CFG0_PLLMF(11)                      /*!< PLL source clock multiply by 13 */
#define RCU_PLL_MUL14                   CFG0_PLLMF(12)                      /*!< PLL source clock multiply by 14 */
#define RCU_PLL_MUL6_5                  CFG0_PLLMF(13)                      /*!< PLL source clock multiply by 6.5 */
#define RCU_PLL_MUL16                   CFG0_PLLMF(14)                      /*!< PLL source clock multiply by 16 */
#define RCU_PLL_MUL17                   (PLLMF_4 | CFG0_PLLMF(0))           /*!< PLL source clock multiply by 17 */
#define RCU_PLL_MUL18                   (PLLMF_4 | CFG0_PLLMF(1))           /*!< PLL source clock multiply by 18 */
#define RCU_PLL_MUL19                   (PLLMF_4 | CFG0_PLLMF(2))           /*!< PLL source clock multiply by 19 */
#define RCU_PLL_MUL20                   (PLLMF_4 | CFG0_PLLMF(3))           /*!< PLL source clock multiply by 20 */
#define RCU_PLL_MUL21                   (PLLMF_4 | CFG0_PLLMF(4))           /*!< PLL source clock multiply by 21 */
#define RCU_PLL_MUL22                   (PLLMF_4 | CFG0_PLLMF(5))           /*!< PLL source clock multiply by 22 */
#define RCU_PLL_MUL23                   (PLLMF_4 | CFG0_PLLMF(6))           /*!< PLL source clock multiply by 23 */
#define RCU_PLL_MUL24                   (PLLMF_4 | CFG0_PLLMF(7))           /*!< PLL source clock multiply by 24 */
#define RCU_PLL_MUL25                   (PLLMF_4 | CFG0_PLLMF(8))           /*!< PLL source clock multiply by 25 */
#define RCU_PLL_MUL26                   (PLLMF_4 | CFG0_PLLMF(9))           /*!< PLL source clock multiply by 26 */
#define RCU_PLL_MUL27                   (PLLMF_4 | CFG0_PLLMF(10))          /*!< PLL source clock multiply by 27 */
#define RCU_PLL_MUL28                   (PLLMF_4 | CFG0_PLLMF(11))          /*!< PLL source clock multiply by 28 */
#define RCU_PLL_MUL29                   (PLLMF_4 | CFG0_PLLMF(12))          /*!< PLL source clock multiply by 29 */
#define RCU_PLL_MUL30                   (PLLMF_4 | CFG0_PLLMF(13))          /*!< PLL source clock multiply by 30 */
#define RCU_PLL_MUL31                   (PLLMF_4 | CFG0_PLLMF(14))          /*!< PLL source clock multiply by 31 */
#define RCU_PLL_MUL32                   (PLLMF_4 | CFG0_PLLMF(15))          /*!< PLL source clock multiply by 32 */

/* USBFS/TRNG prescaler selection */
#define CFG0_USBFSPSC(regval)           (BITS(22,23) & ((uint32_t)(regval) << 22))
#define RCU_CKUSB_CKPLL_DIV1_5          CFG0_USBFSPSC(0)                    /*!< USBFS/TRNG prescaler select CK_PLL/1.5 */
#define RCU_CKUSB_CKPLL_DIV1            CFG0_USBFSPSC(1)                    /*!< USBFS/TRNG prescaler select CK_PLL/1 */
#define RCU_CKUSB_CKPLL_DIV2_5          CFG0_USBFSPSC(2)                    /*!< USBFS/TRNG prescaler select CK_PLL/2.5 */
#define RCU_CKUSB_CKPLL_DIV2            CFG0_USBFSPSC(3)                    /*!< USBFS/TRNG prescaler select CK_PLL/2 */

/* CKOUT0 Clock source selection */
#define CFG0_CKOUT0SEL(regval)          (BITS(24,27) & ((uint32_t)(regval) << 24))
#define RCU_CKOUT0SRC_NONE              CFG0_CKOUT0SEL(0)                   /*!< no clock selected */
#define RCU_CKOUT0SRC_CKSYS             CFG0_CKOUT0SEL(4)                   /*!< system clock selected */
#define RCU_CKOUT0SRC_IRC8M             CFG0_CKOUT0SEL(5)                   /*!< internal 8M RC oscillator clock selected */
#define RCU_CKOUT0SRC_HXTAL             CFG0_CKOUT0SEL(6)                   /*!< high speed crystal oscillator clock (HXTAL) selected */
#define RCU_CKOUT0SRC_CKPLL_DIV2        CFG0_CKOUT0SEL(7)                   /*!< CK_PLL/2 clock selected */
#define RCU_CKOUT0SRC_CKPLL1            CFG0_CKOUT0SEL(8)                   /*!< CK_PLL1 clock selected */
#define RCU_CKOUT0SRC_CKPLL2_DIV2       CFG0_CKOUT0SEL(9)                   /*!< CK_PLL2/2 clock selected */
#define RCU_CKOUT0SRC_EXT1              CFG0_CKOUT0SEL(10)                  /*!< EXT1 selected, to provide the external clock for ENET */
#define RCU_CKOUT0SRC_CKPLL2            CFG0_CKOUT0SEL(11)                  /*!< CK_PLL2 clock selected */

/* LXTAL drive capability */
#define BDCTL_LXTALDRI(regval)          (BITS(3,4) & ((uint32_t)(regval) << 3))
#define RCU_LXTAL_LOWDRI                BDCTL_LXTALDRI(0)                   /*!< lower driving capability */
#define RCU_LXTAL_MED_LOWDRI            BDCTL_LXTALDRI(1)                   /*!< medium low driving capability */
#define RCU_LXTAL_MED_HIGHDRI           BDCTL_LXTALDRI(2)                   /*!< medium high driving capability */
#define RCU_LXTAL_HIGHDRI               BDCTL_LXTALDRI(3)                   /*!< higher driving capability */

/* RTC clock entry selection */
#define BDCTL_RTCSRC(regval)            (BITS(8,9) & ((uint32_t)(regval) << 8))
#define RCU_RTCSRC_NONE                 BDCTL_RTCSRC(0)                     /*!< no clock selected */
#define RCU_RTCSRC_LXTAL                BDCTL_RTCSRC(1)                     /*!< RTC source clock select LXTAL  */
#define RCU_RTCSRC_IRC40K               BDCTL_RTCSRC(2)                     /*!< RTC source clock select IRC40K */
#define RCU_RTCSRC_HXTAL_DIV128         BDCTL_RTCSRC(3)                     /*!< RTC source clock select HXTAL/128 */

/* PREDV0 division factor */
#define CFG1_PREDV0(regval)             (BITS(0,3) & ((uint32_t)(regval) << 0))
#define RCU_PREDV0_DIV1                 CFG1_PREDV0(0)                      /*!< PREDV0 input source clock divided by 1 */
#define RCU_PREDV0_DIV2                 CFG1_PREDV0(1)                      /*!< PREDV0 input source clock divided by 2 */
#define RCU_PREDV0_DIV3                 CFG1_PREDV0(2)                      /*!< PREDV0 input source clock divided by 3 */
#define RCU_PREDV0_DIV4                 CFG1_PREDV0(3)                      /*!< PREDV0 input source clock divided by 4 */
#define RCU_PREDV0_DIV5                 CFG1_PREDV0(4)                      /*!< PREDV0 input source clock divided by 5 */
#define RCU_PREDV0_DIV6                 CFG1_PREDV0(5)                      /*!< PREDV0 input source clock divided by 6 */
#define RCU_PREDV0_DIV7                 CFG1_PREDV0(6)                      /*!< PREDV0 input source clock divided by 7 */
#define RCU_PREDV0_DIV8                 CFG1_PREDV0(7)                      /*!< PREDV0 input source clock divided by 8 */
#define RCU_PREDV0_DIV9                 CFG1_PREDV0(8)                      /*!< PREDV0 input source clock divided by 9 */
#define RCU_PREDV0_DIV10                CFG1_PREDV0(9)                      /*!< PREDV0 input source clock divided by 10 */
#define RCU_PREDV0_DIV11                CFG1_PREDV0(10)                     /*!< PREDV0 input source clock divided by 11 */
#define RCU_PREDV0_DIV12                CFG1_PREDV0(11)                     /*!< PREDV0 input source clock divided by 12 */
#define RCU_PREDV0_DIV13                CFG1_PREDV0(12)                     /*!< PREDV0 input source clock divided by 13 */
#define RCU_PREDV0_DIV14                CFG1_PREDV0(13)                     /*!< PREDV0 input source clock divided by 14 */
#define RCU_PREDV0_DIV15                CFG1_PREDV0(14)                     /*!< PREDV0 input source clock divided by 15 */
#define RCU_PREDV0_DIV16                CFG1_PREDV0(15)                     /*!< PREDV0 input source clock divided by 16 */

/* PREDV1 division factor */
#define CFG1_PREDV1(regval)            (BITS(4,7) & ((uint32_t)(regval) << 4))
#define RCU_PREDV1_DIV1                CFG1_PREDV1(0)                      /*!< PREDV1 input source clock divided by 1 */
#define RCU_PREDV1_DIV2                CFG1_PREDV1(1)                      /*!< PREDV1 input source clock divided by 2 */
#define RCU_PREDV1_DIV3                CFG1_PREDV1(2)                      /*!< PREDV1 input source clock divided by 3 */
#define RCU_PREDV1_DIV4                CFG1_PREDV1(3)                      /*!< PREDV1 input source clock divided by 4 */
#define RCU_PREDV1_DIV5                CFG1_PREDV1(4)                      /*!< PREDV1 input source clock divided by 5 */
#define RCU_PREDV1_DIV6                CFG1_PREDV1(5)                      /*!< PREDV1 input source clock divided by 6 */
#define RCU_PREDV1_DIV7                CFG1_PREDV1(6)                      /*!< PREDV1 input source clock divided by 7 */
#define RCU_PREDV1_DIV8                CFG1_PREDV1(7)                      /*!< PREDV1 input source clock divided by 8 */
#define RCU_PREDV1_DIV9                CFG1_PREDV1(8)                      /*!< PREDV1 input source clock divided by 9 */
#define RCU_PREDV1_DIV10               CFG1_PREDV1(9)                      /*!< PREDV1 input source clock divided by 10 */
#define RCU_PREDV1_DIV11               CFG1_PREDV1(10)                     /*!< PREDV1 input source clock divided by 11 */
#define RCU_PREDV1_DIV12               CFG1_PREDV1(11)                     /*!< PREDV1 input source clock divided by 12 */
#define RCU_PREDV1_DIV13               CFG1_PREDV1(12)                     /*!< PREDV1 input source clock divided by 13 */
#define RCU_PREDV1_DIV14               CFG1_PREDV1(13)                     /*!< PREDV1 input source clock divided by 14 */
#define RCU_PREDV1_DIV15               CFG1_PREDV1(14)                     /*!< PREDV1 input source clock divided by 15 */
#define RCU_PREDV1_DIV16               CFG1_PREDV1(15)                     /*!< PREDV1 input source clock divided by 16 */

/* PLL1 clock multiplication factor */
#define CFG1_PLL1MF(regval)             (BITS(8,11) & ((uint32_t)(regval) << 8))
#define RCU_PLL1_MUL8                   CFG1_PLL1MF(6)                      /*!< PLL1 source clock multiply by 8 */
#define RCU_PLL1_MUL9                   CFG1_PLL1MF(7)                      /*!< PLL1 source clock multiply by 9 */
#define RCU_PLL1_MUL10                  CFG1_PLL1MF(8)                      /*!< PLL1 source clock multiply by 10 */
#define RCU_PLL1_MUL11                  CFG1_PLL1MF(9)                      /*!< PLL1 source clock multiply by 11 */
#define RCU_PLL1_MUL12                  CFG1_PLL1MF(10)                     /*!< PLL1 source clock multiply by 12 */
#define RCU_PLL1_MUL13                  CFG1_PLL1MF(11)                     /*!< PLL1 source clock multiply by 13 */
#define RCU_PLL1_MUL14                  CFG1_PLL1MF(12)                     /*!< PLL1 source clock multiply by 14 */
#define RCU_PLL1_MUL15                  CFG1_PLL1MF(13)                     /*!< PLL1 source clock multiply by 15 */
#define RCU_PLL1_MUL16                  CFG1_PLL1MF(14)                     /*!< PLL1 source clock multiply by 16 */
#define RCU_PLL1_MUL20                  CFG1_PLL1MF(15)                     /*!< PLL1 source clock multiply by 20 */

/* PLL2 clock multiplication factor */
#define CFG1_PLL2MF(regval)             (BITS(12,15) & ((uint32_t)(regval) << 12))
#define RCU_PLL2_MUL8                   CFG1_PLL2MF(6)                      /*!< PLL2 source clock multiply by 8 */
#define RCU_PLL2_MUL9                   CFG1_PLL2MF(7)                      /*!< PLL2 source clock multiply by 9 */
#define RCU_PLL2_MUL10                  CFG1_PLL2MF(8)                      /*!< PLL2 source clock multiply by 10 */
#define RCU_PLL2_MUL11                  CFG1_PLL2MF(9)                      /*!< PLL2 source clock multiply by 11 */
#define RCU_PLL2_MUL12                  CFG1_PLL2MF(10)                     /*!< PLL2 source clock multiply by 12 */
#define RCU_PLL2_MUL13                  CFG1_PLL2MF(11)                     /*!< PLL2 source clock multiply by 13 */
#define RCU_PLL2_MUL14                  CFG1_PLL2MF(12)                     /*!< PLL2 source clock multiply by 14 */
#define RCU_PLL2_MUL15                  CFG1_PLL2MF(13)                     /*!< PLL2 source clock multiply by 15 */
#define RCU_PLL2_MUL16                  CFG1_PLL2MF(14)                     /*!< PLL2 source clock multiply by 16 */
#define RCU_PLL2_MUL20                  CFG1_PLL2MF(15)                     /*!< PLL2 source clock multiply by 20 */

/* PREDV0 input clock source selection */
#define RCU_PREDV0SRC_HXTAL             ((uint32_t)0x00000000U)             /*!< HXTAL selected as PREDV0 input source clock */
#define RCU_PREDV0SRC_CKPLL1            RCU_CFG1_PREDV0SEL                  /*!< CK_PLL1 selected as PREDV0 input source clock */

/* I2S1 clock source selection */
#define RCU_I2S1SRC_CKSYS               ((uint32_t)0x00000000U)             /*!< system clock selected as I2S1 source clock */
#define RCU_I2S1SRC_CKPLL2_MUL2         RCU_CFG1_I2S1SEL                    /*!< (CK_PLL2 x 2) selected as I2S1 source clock */

/* I2S2 clock source selection */
#define RCU_I2S2SRC_CKSYS               ((uint32_t)0x00000000U)             /*!< system clock selected as I2S2 source clock */
#define RCU_I2S2SRC_CKPLL2_MUL2         RCU_CFG1_I2S2SEL                    /*!< (CK_PLL2 x 2) selected as I2S2 source clock */

/* deep-sleep mode voltage */
#define DSV_DSLPVS(regval)              (BITS(0,2) & ((uint32_t)(regval) << 0))
#define RCU_DEEPSLEEP_V_1_2             DSV_DSLPVS(0)                       /*!< core voltage is 1.2V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_1_1             DSV_DSLPVS(1)                       /*!< core voltage is 1.1V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_1_0             DSV_DSLPVS(2)                       /*!< core voltage is 1.0V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_0_9             DSV_DSLPVS(3)                       /*!< core voltage is 0.9V in deep-sleep mode */


/* CKOUT0 division factor */
#define CFG2_CKOUT0DIV(regval)          (BITS(0,5) & ((uint32_t)(regval) << 0))
#define RCU_CKOUT0_DIV1                 CFG2_CKOUT0DIV(0)                  /*!< CK_OUT0 is divided by 1 */
#define RCU_CKOUT0_DIV2                 CFG2_CKOUT0DIV(1)                  /*!< CK_OUT0 is divided by 2 */
#define RCU_CKOUT0_DIV3                 CFG2_CKOUT0DIV(2)                  /*!< CK_OUT0 is divided by 3 */
#define RCU_CKOUT0_DIV4                 CFG2_CKOUT0DIV(3)                  /*!< CK_OUT0 is divided by 4 */
#define RCU_CKOUT0_DIV5                 CFG2_CKOUT0DIV(4)                  /*!< CK_OUT0 is divided by 5 */
#define RCU_CKOUT0_DIV6                 CFG2_CKOUT0DIV(5)                  /*!< CK_OUT0 is divided by 6 */
#define RCU_CKOUT0_DIV7                 CFG2_CKOUT0DIV(6)                  /*!< CK_OUT0 is divided by 7 */
#define RCU_CKOUT0_DIV8                 CFG2_CKOUT0DIV(7)                  /*!< CK_OUT0 is divided by 8 */
#define RCU_CKOUT0_DIV9                 CFG2_CKOUT0DIV(8)                  /*!< CK_OUT0 is divided by 9 */
#define RCU_CKOUT0_DIV10                CFG2_CKOUT0DIV(9)                  /*!< CK_OUT0 is divided by 10 */
#define RCU_CKOUT0_DIV11                CFG2_CKOUT0DIV(10)                 /*!< CK_OUT0 is divided by 11 */
#define RCU_CKOUT0_DIV12                CFG2_CKOUT0DIV(11)                 /*!< CK_OUT0 is divided by 12 */
#define RCU_CKOUT0_DIV13                CFG2_CKOUT0DIV(12)                 /*!< CK_OUT0 is divided by 13 */
#define RCU_CKOUT0_DIV14                CFG2_CKOUT0DIV(13)                 /*!< CK_OUT0 is divided by 14 */
#define RCU_CKOUT0_DIV15                CFG2_CKOUT0DIV(14)                 /*!< CK_OUT0 is divided by 15 */
#define RCU_CKOUT0_DIV16                CFG2_CKOUT0DIV(15)                 /*!< CK_OUT0 is divided by 16 */
#define RCU_CKOUT0_DIV17                CFG2_CKOUT0DIV(16)                 /*!< CK_OUT0 is divided by 17 */
#define RCU_CKOUT0_DIV18                CFG2_CKOUT0DIV(17)                 /*!< CK_OUT0 is divided by 18 */
#define RCU_CKOUT0_DIV19                CFG2_CKOUT0DIV(18)                 /*!< CK_OUT0 is divided by 19 */
#define RCU_CKOUT0_DIV20                CFG2_CKOUT0DIV(19)                 /*!< CK_OUT0 is divided by 20 */
#define RCU_CKOUT0_DIV21                CFG2_CKOUT0DIV(20)                 /*!< CK_OUT0 is divided by 21 */
#define RCU_CKOUT0_DIV22                CFG2_CKOUT0DIV(21)                 /*!< CK_OUT0 is divided by 22 */
#define RCU_CKOUT0_DIV23                CFG2_CKOUT0DIV(22)                 /*!< CK_OUT0 is divided by 23 */
#define RCU_CKOUT0_DIV24                CFG2_CKOUT0DIV(23)                 /*!< CK_OUT0 is divided by 24 */
#define RCU_CKOUT0_DIV25                CFG2_CKOUT0DIV(24)                 /*!< CK_OUT0 is divided by 25 */
#define RCU_CKOUT0_DIV26                CFG2_CKOUT0DIV(25)                 /*!< CK_OUT0 is divided by 26 */
#define RCU_CKOUT0_DIV27                CFG2_CKOUT0DIV(26)                 /*!< CK_OUT0 is divided by 27 */
#define RCU_CKOUT0_DIV28                CFG2_CKOUT0DIV(27)                 /*!< CK_OUT0 is divided by 28 */
#define RCU_CKOUT0_DIV29                CFG2_CKOUT0DIV(28)                 /*!< CK_OUT0 is divided by 29 */
#define RCU_CKOUT0_DIV30                CFG2_CKOUT0DIV(29)                 /*!< CK_OUT0 is divided by 30 */
#define RCU_CKOUT0_DIV31                CFG2_CKOUT0DIV(30)                 /*!< CK_OUT0 is divided by 31 */
#define RCU_CKOUT0_DIV32                CFG2_CKOUT0DIV(31)                 /*!< CK_OUT0 is divided by 32 */
#define RCU_CKOUT0_DIV33                CFG2_CKOUT0DIV(32)                 /*!< CK_OUT0 is divided by 33 */
#define RCU_CKOUT0_DIV34                CFG2_CKOUT0DIV(33)                 /*!< CK_OUT0 is divided by 34 */
#define RCU_CKOUT0_DIV35                CFG2_CKOUT0DIV(34)                 /*!< CK_OUT0 is divided by 35 */
#define RCU_CKOUT0_DIV36                CFG2_CKOUT0DIV(35)                 /*!< CK_OUT0 is divided by 36 */
#define RCU_CKOUT0_DIV37                CFG2_CKOUT0DIV(36)                 /*!< CK_OUT0 is divided by 37 */
#define RCU_CKOUT0_DIV38                CFG2_CKOUT0DIV(37)                 /*!< CK_OUT0 is divided by 38 */
#define RCU_CKOUT0_DIV39                CFG2_CKOUT0DIV(38)                 /*!< CK_OUT0 is divided by 39 */
#define RCU_CKOUT0_DIV40                CFG2_CKOUT0DIV(39)                 /*!< CK_OUT0 is divided by 40 */
#define RCU_CKOUT0_DIV41                CFG2_CKOUT0DIV(40)                 /*!< CK_OUT0 is divided by 41 */
#define RCU_CKOUT0_DIV42                CFG2_CKOUT0DIV(41)                 /*!< CK_OUT0 is divided by 42 */
#define RCU_CKOUT0_DIV43                CFG2_CKOUT0DIV(42)                 /*!< CK_OUT0 is divided by 43 */
#define RCU_CKOUT0_DIV44                CFG2_CKOUT0DIV(43)                 /*!< CK_OUT0 is divided by 44 */
#define RCU_CKOUT0_DIV45                CFG2_CKOUT0DIV(44)                 /*!< CK_OUT0 is divided by 45 */
#define RCU_CKOUT0_DIV46                CFG2_CKOUT0DIV(45)                 /*!< CK_OUT0 is divided by 46 */
#define RCU_CKOUT0_DIV47                CFG2_CKOUT0DIV(46)                 /*!< CK_OUT0 is divided by 47 */
#define RCU_CKOUT0_DIV48                CFG2_CKOUT0DIV(47)                 /*!< CK_OUT0 is divided by 48 */
#define RCU_CKOUT0_DIV49                CFG2_CKOUT0DIV(48)                 /*!< CK_OUT0 is divided by 49 */
#define RCU_CKOUT0_DIV50                CFG2_CKOUT0DIV(49)                 /*!< CK_OUT0 is divided by 20 */
#define RCU_CKOUT0_DIV51                CFG2_CKOUT0DIV(40)                 /*!< CK_OUT0 is divided by 51 */
#define RCU_CKOUT0_DIV52                CFG2_CKOUT0DIV(51)                 /*!< CK_OUT0 is divided by 52 */
#define RCU_CKOUT0_DIV53                CFG2_CKOUT0DIV(52)                 /*!< CK_OUT0 is divided by 53 */
#define RCU_CKOUT0_DIV54                CFG2_CKOUT0DIV(53)                 /*!< CK_OUT0 is divided by 54 */
#define RCU_CKOUT0_DIV55                CFG2_CKOUT0DIV(54)                 /*!< CK_OUT0 is divided by 55 */
#define RCU_CKOUT0_DIV56                CFG2_CKOUT0DIV(55)                 /*!< CK_OUT0 is divided by 56 */
#define RCU_CKOUT0_DIV57                CFG2_CKOUT0DIV(56)                 /*!< CK_OUT0 is divided by 57 */
#define RCU_CKOUT0_DIV58                CFG2_CKOUT0DIV(57)                 /*!< CK_OUT0 is divided by 58 */
#define RCU_CKOUT0_DIV59                CFG2_CKOUT0DIV(58)                 /*!< CK_OUT0 is divided by 59 */
#define RCU_CKOUT0_DIV60                CFG2_CKOUT0DIV(59)                 /*!< CK_OUT0 is divided by 60 */
#define RCU_CKOUT0_DIV61                CFG2_CKOUT0DIV(60)                 /*!< CK_OUT0 is divided by 61 */
#define RCU_CKOUT0_DIV62                CFG2_CKOUT0DIV(61)                 /*!< CK_OUT0 is divided by 62 */
#define RCU_CKOUT0_DIV63                CFG2_CKOUT0DIV(62)                 /*!< CK_OUT0 is divided by 63 */
#define RCU_CKOUT0_DIV64                CFG2_CKOUT0DIV(63)                 /*!< CK_OUT0 is divided by 64 */

