RT-Thread/rt-thread/bsp/gd32/libraries/GD32F2xx_STD/GD32F20x_standard_peripheral/Include/gd32f20x_rcu.h
/* CKOUT1 division factor */
#define CFG2_CKOUT1DIV(regval)          (BITS(8,13) & ((uint32_t)(regval) << 8))
#define RCU_CKOUT1_DIV1                 CFG2_CKOUT1DIV(0)                  /*!< CK_OUT1 is divided by 1 */
#define RCU_CKOUT1_DIV2                 CFG2_CKOUT1DIV(1)                  /*!< CK_OUT1 is divided by 2 */
#define RCU_CKOUT1_DIV3                 CFG2_CKOUT1DIV(2)                  /*!< CK_OUT1 is divided by 3 */
#define RCU_CKOUT1_DIV4                 CFG2_CKOUT1DIV(3)                  /*!< CK_OUT1 is divided by 4 */
#define RCU_CKOUT1_DIV5                 CFG2_CKOUT1DIV(4)                  /*!< CK_OUT1 is divided by 5 */
#define RCU_CKOUT1_DIV6                 CFG2_CKOUT1DIV(5)                  /*!< CK_OUT1 is divided by 6 */
#define RCU_CKOUT1_DIV7                 CFG2_CKOUT1DIV(6)                  /*!< CK_OUT1 is divided by 7 */
#define RCU_CKOUT1_DIV8                 CFG2_CKOUT1DIV(7)                  /*!< CK_OUT1 is divided by 8 */
#define RCU_CKOUT1_DIV9                 CFG2_CKOUT1DIV(8)                  /*!< CK_OUT1 is divided by 9 */
#define RCU_CKOUT1_DIV10                CFG2_CKOUT1DIV(9)                  /*!< CK_OUT1 is divided by 10 */
#define RCU_CKOUT1_DIV11                CFG2_CKOUT1DIV(10)                 /*!< CK_OUT1 is divided by 11 */
#define RCU_CKOUT1_DIV12                CFG2_CKOUT1DIV(11)                 /*!< CK_OUT1 is divided by 12 */
#define RCU_CKOUT1_DIV13                CFG2_CKOUT1DIV(12)                 /*!< CK_OUT1 is divided by 13 */
#define RCU_CKOUT1_DIV14                CFG2_CKOUT1DIV(13)                 /*!< CK_OUT1 is divided by 14 */
#define RCU_CKOUT1_DIV15                CFG2_CKOUT1DIV(14)                 /*!< CK_OUT1 is divided by 15 */
#define RCU_CKOUT1_DIV16                CFG2_CKOUT1DIV(15)                 /*!< CK_OUT1 is divided by 16 */
#define RCU_CKOUT1_DIV17                CFG2_CKOUT1DIV(16)                 /*!< CK_OUT1 is divided by 17 */
#define RCU_CKOUT1_DIV18                CFG2_CKOUT1DIV(17)                 /*!< CK_OUT1 is divided by 18 */
#define RCU_CKOUT1_DIV19                CFG2_CKOUT1DIV(18)                 /*!< CK_OUT1 is divided by 19 */
#define RCU_CKOUT1_DIV20                CFG2_CKOUT1DIV(19)                 /*!< CK_OUT1 is divided by 20 */
#define RCU_CKOUT1_DIV21                CFG2_CKOUT1DIV(20)                 /*!< CK_OUT1 is divided by 21 */
#define RCU_CKOUT1_DIV22                CFG2_CKOUT1DIV(21)                 /*!< CK_OUT1 is divided by 22 */
#define RCU_CKOUT1_DIV23                CFG2_CKOUT1DIV(22)                 /*!< CK_OUT1 is divided by 23 */
#define RCU_CKOUT1_DIV24                CFG2_CKOUT1DIV(23)                 /*!< CK_OUT1 is divided by 24 */
#define RCU_CKOUT1_DIV25                CFG2_CKOUT1DIV(24)                 /*!< CK_OUT1 is divided by 25 */
#define RCU_CKOUT1_DIV26                CFG2_CKOUT1DIV(25)                 /*!< CK_OUT1 is divided by 26 */
#define RCU_CKOUT1_DIV27                CFG2_CKOUT1DIV(26)                 /*!< CK_OUT1 is divided by 27 */
#define RCU_CKOUT1_DIV28                CFG2_CKOUT1DIV(27)                 /*!< CK_OUT1 is divided by 28 */
#define RCU_CKOUT1_DIV29                CFG2_CKOUT1DIV(28)                 /*!< CK_OUT1 is divided by 29 */
#define RCU_CKOUT1_DIV30                CFG2_CKOUT1DIV(29)                 /*!< CK_OUT1 is divided by 30 */
#define RCU_CKOUT1_DIV31                CFG2_CKOUT1DIV(30)                 /*!< CK_OUT1 is divided by 31 */
#define RCU_CKOUT1_DIV32                CFG2_CKOUT1DIV(31)                 /*!< CK_OUT1 is divided by 32 */
#define RCU_CKOUT1_DIV33                CFG2_CKOUT1DIV(32)                 /*!< CK_OUT1 is divided by 33 */
#define RCU_CKOUT1_DIV34                CFG2_CKOUT1DIV(33)                 /*!< CK_OUT1 is divided by 34 */
#define RCU_CKOUT1_DIV35                CFG2_CKOUT1DIV(34)                 /*!< CK_OUT1 is divided by 35 */
#define RCU_CKOUT1_DIV36                CFG2_CKOUT1DIV(35)                 /*!< CK_OUT1 is divided by 36 */
#define RCU_CKOUT1_DIV37                CFG2_CKOUT1DIV(36)                 /*!< CK_OUT1 is divided by 37 */
#define RCU_CKOUT1_DIV38                CFG2_CKOUT1DIV(37)                 /*!< CK_OUT1 is divided by 38 */
#define RCU_CKOUT1_DIV39                CFG2_CKOUT1DIV(38)                 /*!< CK_OUT1 is divided by 39 */
#define RCU_CKOUT1_DIV40                CFG2_CKOUT1DIV(39)                 /*!< CK_OUT1 is divided by 40 */
#define RCU_CKOUT1_DIV41                CFG2_CKOUT1DIV(40)                 /*!< CK_OUT1 is divided by 41 */
#define RCU_CKOUT1_DIV42                CFG2_CKOUT1DIV(41)                 /*!< CK_OUT1 is divided by 42 */
#define RCU_CKOUT1_DIV43                CFG2_CKOUT1DIV(42)                 /*!< CK_OUT1 is divided by 43 */
#define RCU_CKOUT1_DIV44                CFG2_CKOUT1DIV(43)                 /*!< CK_OUT1 is divided by 44 */
#define RCU_CKOUT1_DIV45                CFG2_CKOUT1DIV(44)                 /*!< CK_OUT1 is divided by 45 */
#define RCU_CKOUT1_DIV46                CFG2_CKOUT1DIV(45)                 /*!< CK_OUT1 is divided by 46 */
#define RCU_CKOUT1_DIV47                CFG2_CKOUT1DIV(46)                 /*!< CK_OUT1 is divided by 47 */
#define RCU_CKOUT1_DIV48                CFG2_CKOUT1DIV(47)                 /*!< CK_OUT1 is divided by 48 */
#define RCU_CKOUT1_DIV49                CFG2_CKOUT1DIV(48)                 /*!< CK_OUT1 is divided by 49 */
#define RCU_CKOUT1_DIV50                CFG2_CKOUT1DIV(49)                 /*!< CK_OUT1 is divided by 20 */
#define RCU_CKOUT1_DIV51                CFG2_CKOUT1DIV(40)                 /*!< CK_OUT1 is divided by 51 */
#define RCU_CKOUT1_DIV52                CFG2_CKOUT1DIV(51)                 /*!< CK_OUT1 is divided by 52 */
#define RCU_CKOUT1_DIV53                CFG2_CKOUT1DIV(52)                 /*!< CK_OUT1 is divided by 53 */
#define RCU_CKOUT1_DIV54                CFG2_CKOUT1DIV(53)                 /*!< CK_OUT1 is divided by 54 */
#define RCU_CKOUT1_DIV55                CFG2_CKOUT1DIV(54)                 /*!< CK_OUT1 is divided by 55 */
#define RCU_CKOUT1_DIV56                CFG2_CKOUT1DIV(55)                 /*!< CK_OUT1 is divided by 56 */
#define RCU_CKOUT1_DIV57                CFG2_CKOUT1DIV(56)                 /*!< CK_OUT1 is divided by 57 */
#define RCU_CKOUT1_DIV58                CFG2_CKOUT1DIV(57)                 /*!< CK_OUT1 is divided by 58 */
#define RCU_CKOUT1_DIV59                CFG2_CKOUT1DIV(58)                 /*!< CK_OUT1 is divided by 59 */
#define RCU_CKOUT1_DIV60                CFG2_CKOUT1DIV(59)                 /*!< CK_OUT1 is divided by 60 */
#define RCU_CKOUT1_DIV61                CFG2_CKOUT1DIV(60)                 /*!< CK_OUT1 is divided by 61 */
#define RCU_CKOUT1_DIV62                CFG2_CKOUT1DIV(61)                 /*!< CK_OUT1 is divided by 62 */
#define RCU_CKOUT1_DIV63                CFG2_CKOUT1DIV(62)                 /*!< CK_OUT1 is divided by 63 */
#define RCU_CKOUT1_DIV64                CFG2_CKOUT1DIV(63)                 /*!< CK_OUT1 is divided by 64 */

/* CKOUT1 Clock source selection */
#define CFG2_CKOUT1SEL(regval)          (BITS(16,19) & ((uint32_t)(regval) << 16))
#define RCU_CKOUT1SRC_NONE              CFG2_CKOUT1SEL(0)                   /*!< no clock selected */
#define RCU_CKOUT1SRC_CKSYS             CFG2_CKOUT1SEL(4)                   /*!< system clock selected */
#define RCU_CKOUT1SRC_IRC8M             CFG2_CKOUT1SEL(5)                   /*!< internal 8M RC oscillator clock selected */
#define RCU_CKOUT1SRC_HXTAL             CFG2_CKOUT1SEL(6)                   /*!< high speed crystal oscillator clock (HXTAL) selected */
#define RCU_CKOUT1SRC_CKPLL_DIV2        CFG2_CKOUT1SEL(7)                   /*!< CK_PLL/2 clock selected */
#define RCU_CKOUT1SRC_CKPLL1            CFG2_CKOUT1SEL(8)                   /*!< CK_PLL1 clock selected */
#define RCU_CKOUT1SRC_CKPLL2_DIV2       CFG2_CKOUT1SEL(9)                   /*!< CK_PLL2/2 clock selected */
#define RCU_CKOUT1SRC_EXT1              CFG2_CKOUT1SEL(10)                  /*!< EXT1 selected, to provide the external clock for ENET */
#define RCU_CKOUT1SRC_CKPLL2            CFG2_CKOUT1SEL(11)                  /*!< CK_PLL2 clock selected */

/* PLLT division factor */
#define PLLTCFG_PLLTPSC(regval)         (BITS(0,5) & ((uint32_t)(regval) << 0))

